baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       1930;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       1980;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       2030;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       2050;
    }
    wedgePatch1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1000;
        startFace       2050;
    }
    wedgePatch2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1000;
        startFace       3050;
    }
)

// ************************************************************************* //
