baseCase/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

	for i in 0/*.origin; do cp "$i" "${i%.origin}"; done

runApplication blockMesh 
funkySetFields -time 0

#runApplication $application

#------------------------------------------------------------------------------
